rolfz/stc1000p/src/page0.c
/*
 * STC1000+, improved firmware and Arduino based firmware uploader for the STC-1000 dual stage thermostat.
 *
 * Copyright 2014 Mats Staffansson
 *
 * This file is part of STC1000+.
 *
 * STC1000+ is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * STC1000+ is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with STC1000+.  If not, see <http://www.gnu.org/licenses/>.
 *
 * 
 * ADDED BY ROLF ZIEGLER DURING PIC18f Implementation
 * 
 * B2 means 2nd sensor
 * COM means communication enabled
 * Timer0   433mhz transmission
 * Timer1                                           32khz timer to get 1sec pulses
 * Timer2   display led data interrupt 1ms cycle    general 1ms timer
 * Timer3
 * Timer4   reading sensor time
 * Timer6   handles buttons pressed        
 * 
 */


#include <p18cxxx.h>
#include "stc1000p.h"

/* Defines */

/* Configuration words */
///unsigned int __at _CONFIG1 __CONFIG1 = 0xFD4;
///unsigned int __at _CONFIG2 __CONFIG2 = 0x3AFF;

#pragma config OSC = INTIO67	// You can write this way
#pragma config FCMEN = OFF		  // OR this way 
#pragma config MCLRE = ON
#pragma config IESO = OFF 
#pragma config PWRT = OFF // power up timer
#pragma config BOREN = OFF                                     
//#pragma config BORV = 3
//#pragma config VREGEN = OFF
#if defined (__DEBUG)
#pragma config WDT = OFF
#else
#pragma config WDT = ON
#endif
#pragma config CP0 = OFF, CP1 = OFF //, CP2 = OFF, CP3 = OFF
#pragma config CPB = OFF
#pragma config CPD = OFF
#pragma config WRT0 = OFF, WRT1 = OFF //, WRT2 = OFF, WRT3 = OFF
#pragma config LVP = OFF
#pragma config DEBUG = ON//#pragma config LPT1OSC = ON

/* Temperature lookup table  */
#ifdef FAHRENHEIT
const int ad_lookup[] = { 0, -555, -319, -167, -49, 48, 134, 211, 282, 348, 412, 474, 534, 593, 652, 711, 770, 831, 893, 957, 1025, 1096, 1172, 1253, 1343, 1444, 1559, 1694, 1860, 2078, 2397, 2987 };
#else  // CELSIUS
const int ad_lookup[] = { 0, -486, -355, -270, -205, -151, -104, -61, -21, 16, 51, 85, 119, 152, 184, 217, 250, 284, 318, 354, 391, 431, 473, 519, 569, 624, 688, 763, 856, 977, 1154, 1482 };

// table starting at -25deg with value 0, increasing by 5 deg per step up to 130deg C = 32 values
// Source of the table is an interpolation based on mesured values (-10deg freezer, 0deg melting ice, 100deg boiling water)
// http://www.thinksrs.com/downloads/programs/Therm%20Calc/NTCCalibrator/NTCcalculator.htm
//const int ad_lookup[] = {0, -430, -404, -372, -333, -288, -237, -181, -122, -61, -1, 44, 116, 170, 214, 257, 294, 327, 352, 376, 396, 413, 427, 439,449, 458, 466, 472, 482, 486, 496,501 };
#endif

/* LED character lookup table (0-15), includes hex */
//unsigned const char led_lookup[] = { 0x3, 0xb7, 0xd, 0x25, 0xb1, 0x61, 0x41, 0x37, 0x1, 0x21, 0x5, 0xc1, 0xcd, 0x85, 0x9, 0x59 };
/* LED character lookup table (0-9) */
unsigned const char led_lookup[] = { LED_0, LED_1, LED_2, LED_3, LED_4, LED_5, LED_6, LED_7, LED_8, LED_9 };

/* Global variables to hold LED data (for multiplexing purposes) */
led_e_t led_e = {0};
led_t led_10, led_1, led_01 ={0};

//char rom digi[4]=  {0xf0-0x80,0xf0-0x20,0xf0-0x40,0xf0-0x10};
    
int temperature=0; // store temperature in 0.1deg steps (temp*10)
    
#define SAMPLES 64L

#if defined PB2
static int temperature2=0;
#elif defined COM
static volatile unsigned char com_data=0;
static volatile unsigned char com_write=0;
static volatile unsigned char com_tmout=0;
static volatile unsigned char com_count=0;
static volatile unsigned char com_state=0;
#elif defined FO433
static volatile unsigned char fo433_data=0;
static unsigned char fo433_state=0;
static volatile unsigned char fo433_count=0;
static volatile unsigned char fo433_send_space=0;
static unsigned char fo433_sec_count = 24;
#endif

#if defined(__18F2520)
// we simulate timer 4 and 6 in software
// timer 6 with 60ms interval
unsigned char tmr6if=0;
unsigned char tmr6cnt=0;
#define TMR6_MAX  112 // 112ms count to get 1 sec pulse
// timer 4 with 120ms interval
unsigned char tmr4if=0;
unsigned char tmr4on=1;
unsigned char tmr4cnt=0;
#define TMR4_MAX 60 // 60ms count freq

//char TMR1GE=0;   // Menu on flag, avoid display temp when menu is on.
char menuON=0;
char alarmFlash=0; 
//RX9=0;      // SA flash flag
//extern char TX9; // 0=sens0 active, 1=sens1 active

#endif

/* Functions.
 * Note: Functions used from other page cannot be static, but functions
 * not used from other page SHOULD be static to decrease overhead.
 * Functions SHOULD be defined before used (ie. not just declared), to
 * decrease overhead. Refer to SDCC manual for more info.
 */

/* Read one configuration data from specified address.
 * arguments: Config address (0-127)
 * return: the read data
 */
unsigned int eeprom_read_config(unsigned char eeprom_address){
	unsigned int data = 0;
	eeprom_address = (eeprom_address << 1);

	do {
		EEADR = eeprom_address; // Data Memory Address to read
		EECON1bits.EEPGD = 0; // Point to DATA memory
		EECON1bits.CFGS = 0; // Deselect config space
		EECON1bits.RD = 1; // Enable read

		data = ((((unsigned int) EEDATA) << 8) | (data >> 8));
	} while(!(eeprom_address++ & 0x1));

	return data; // Return data
}

/* Store one configuration data to the specified address.
 * arguments: Config address (0-127), data
 * return: nothing
 */
void eeprom_write_config(unsigned char eeprom_address,unsigned int data)
{
	// Avoid unnecessary EEPROM writes
	if(data == eeprom_read_config(eeprom_address)){
		return;
	}

	// multiply address by 2 to get eeprom address, as we will be storing 2 bytes.
	eeprom_address = (eeprom_address << 1);

	do {
		// Address to write
	    EEADR = eeprom_address;
	    // Data to write
	    EEDATA = (unsigned char) data;
	    //Point to DATA memory
	    EECON1bits.EEPGD = 0;
	    // Deselect configuration space
	    EECON1bits.CFGS = 0;
	    // Enable write
	    EECON1bits.WREN = 1;

	    // Disable interrupts during write
	    INTCONbits.GIE=0;

