rolfz/stc1000p/src/page0.c
/*******************************************************************************
 *  Initialize hardware etc, on startup.
 * arguments: none
 * returns: nothing
 */
void init() {
    int i;
    
    ADCON1 |= 0x0F;                 // Default all pins to digital
	OSCCON = 0b01101010; // 4MHz

	// Heat, cool as output, Thermistor as input, piezo output
#if defined FO433
	TRISA = 0b00001100;
#else
	SENS_TRIS=0b10100011; // alternative with RA5 and RA7 as KEB input (free RB6/7 for debug)
//	SENS_TRIS=0b00000011;
#endif
	SENS_PORT= 0; // Drive relays and piezo low

	// LED Common cathode C4-C7
	DIG_PORT = 0xF0;
	DIG_TRIS = 0b00001111;

	// LED data  output
    LED_PORT = 0x00;
	LED_TRIS = 0; // led 0-7

   	// Analog input on thermistor
    ADCON1=0b00001110; // vref = vcc, RA0 as sensor input
    //ADCON1=0b00001101; // RA0-RA1 as sensor input
            
    ADCON0=0;
    
	// AD clock FOSC/8 (FOSC = 4MHz)
	ADCON2bits.ADCS0=1; 

    // AD acq time 8TAD
    ADCON2bits.ACQT=0b100; 
  
	// Right justify AD result
	ADCON2bits.ADFM = 1;

	// IMPORTANT FOR BUTTONS TO WORK!!! Disable analog input -> enables digital input
	// ???????????? not required for PIC18F ANSELC = 0;

	// Postscaler 1:1, Enable counter, prescaler 1:4
    T2CON=0;
    T2CONbits.T2CKPS=1;
	// @4MHz, Timer 2 clock is FOSC/4 -> 1MHz prescale 1:4-> 250kHz, 250 gives interrupt every 1 ms
	PR2 = 250;
	// Enable Timer2 interrupt
    T2CONbits.TMR2ON=1;
    IPR1bits.TMR2IP=1; // high priority
	PIE1bits.TMR2IE = 1;
    
#if defined (__P16F2428) 
	// Postscaler 1:15, - , prescaler 1:16
	T4CON = 0b01110010;
    
    tmr4on= eeprom_read_config(EEADR_POWER_ON);
	// @4MHz, Timer 2 clock is FOSC/4 -> 1MHz prescale 1:16-> 62.5kHz, 250 and postscale 1:15 -> 16.66666 Hz or 60ms
	PR4 = 250;

	// Postscaler 1:7, Enable counter, prescaler 1:64
	T6CON = 0b00110111;
	// @4MHz, Timer 2 clock is FOSC/4 -> 1MHz prescale 1:64-> 15.625kHz, 250 and postscale 1:6 -> 8.93Hz or 112ms
	PR6 = 250;
#elif defined(__18F2520)
    // TMR4ON is flag in software
	tmr4on = eeprom_read_config(EEADR_POWER_ON);
    vPR6 = 112;
#endif
    
    
#if defined COM
	// Set PEIE and GIE (enable global interrupts), IOCIE
	INTCON = 0b11001000;
	IOCAP = 2;	// Rising edge detect
	IOCAN = 0;
#else
	// Set PEIE (enable peripheral interrupts, that is for timer2) and GIE (enable global interrupts)

    RCONbits.IPEN = 1;            //enable priority levels
    INTCONbits.GIE=1;
    INTCONbits.GIEH=1;
    
#endif

#if defined FO433
	// Timer 0 prescale 8
	PSA=0;
	PS0=0;
	PS1=1;
	PS2=0;
#endif

}

/* Interrupt service routine.
 * Receives timer2 interrupts every millisecond.
 * Handles multiplexing of the LEDs.
 */

void high_isr(void);
/*********************High priority interrupt vector **************************/
#pragma code high_vector=0x08
void interrupt_at_high_vector(void)
{
  _asm GOTO high_isr _endasm
}

#pragma code
/*******************************High priority ISR *****************************/
#pragma interrupt high_isr
void high_isr (void)
{
static unsigned char latb=0;
#ifdef COM
	if(IOCAF1){

		/* Disable pin change interrupt and edge detection */
		IOCIE = 0;
		IOCAP1 = 0;

		/* If sending a '1' bit */
		if(com_write && (com_data & 0x80)){
			TRISA1 = 0;
			LATA1 = 1;
		}

		/* Init communication reset countdown (10ms) */
		com_tmout = 10;

		/* Enable timer 0 to generate interrupt for reading/writing in 250us */
		TMR0 = 5;
		TMR0CS = 0;
		TMR0IE = 1;

		/* Clear edge detection flag */
		IOCAF = 0;	
	}

	if(TMR0IF){
		/* Disable timer 0 */
		TMR0CS = 1;
		TMR0IE = 0;

		/* Make sure RA1 is input */
		TRISA1 = 1;
		LATA1 = 0;

		/* Shift data */
		com_data <<= 1;
		com_count++;

		/* If receive '1' */
		if(!com_write && RA1){
			com_data |= 1;
		}

		/* Enable edge detection and pin change interrupt */
		IOCAF = 0;
		IOCAP1 = 1;
		IOCIE = 1;

		/* Clear timer 0 interrupt flag */
		TMR0IF = 0;
	}
#elif defined FO433
	if(TMR0IF){
		/* */
		LATA1 = 0;

		if(fo433_send_space){
			fo433_count>>=1;
			TMR0 = 130;
			fo433_send_space = 0;
		} else {
			if(fo433_data & fo433_count){
				TMR0 = 193;
			} else {
				TMR0 = 67;
			}
			LATA1 = 1;
			fo433_send_space = 1;
		}

		if(fo433_count == 0){
			/* Disable timer 0 */
			TMR0CS = 1;
			TMR0IE = 0;
		}

		/* Clear timer 0 interrupt flag */
		TMR0IF = 0;
	}
#endif
	// Check for Timer 2 interrupt (every 1ms)
	// Kind of excessive when it's the only enabled interrupt
	// but is nice as reference if more interrupts should be needed
	if (PIR1bits.TMR2IF) {
#if defined (__16F2626)
        unsigned char latb = (DIG_PORT << 1);
#elif defined (__18F2520)
        
        // lat b used for common cathode, inverted when writing to LED
        latb<<=1;
#endif
        
		if(latb == 0){
			latb = 0x10;
		}
                
		LED_TRIS = LEDOUT; // Ensure LED data pins are outputs
		LED_PORT = LEDOFF; // Disable LED's while switching

		// Multiplex LED's every millisecond
		switch(latb) {
			case 0x10:
			LED_PORT = led_01.raw;
			break;
			case 0x20:
			LED_PORT = led_10.raw;
			break;
			case 0x40: 
			LED_PORT = led_1.raw;
			break;
			case 0x80:
			LED_PORT = led_e.raw;
			break;
		}

		// Enable new LED Digit
        // as cathode on digit, we reverse the bits
		DIG_PORT = ~latb;

#if defined COM
		/* Reset communication state on timeout */
		if(com_tmout){
			com_tmout--;
		} else {
			com_state = 0;
			com_count = 0;
			com_write = 0;
		}
#endif // COM

#if defined (__18F2520)

// software implementation of time 4 and 6 not available in 18f2520 hardware
//            if(tmr6cnt++== TMR6_MAX){   // 112ms
            if(tmr6cnt++ >= vPR6){   // 112ms
                tmr6cnt=0;
                tmr6if=1;
            }

        if(tmr4on){
            
            if(tmr4cnt++ == TMR4_MAX){  // 60ms
                tmr4cnt=0;
                tmr4if=1;
            };
        }
        
#endif
        
		// Clear interrupt flag
		PIR1bits.TMR2IF = 0;
	}
    
} // end ISR

#define _ADON 1
#define _CHS0 2
#define _CHS1 4

#define START_TCONV_1()		(ADCON0 = _CHS0 | _ADON)
#define START_TCONV_2()		(ADCON0 = _CHS1 | _ADON)


unsigned int read_ad(unsigned int adfilter){
    unsigned int tmp;
    
	ADCON0bits.GO = 1;
	while(ADCON0bits.GO);
	ADCON0bits.ADON = 0;

    tmp=((ADRESH *256) + ADRESL); // original code adding high byte did not work with C18 compiler
                                  // took me a long time to find out what was wrong with this code

    // low pass with last 63 values
    return ((adfilter-(adfilter>>6)) + tmp);
}



/******************************************************************************/
int ad_to_temp(unsigned int adfilter){
	unsigned char i;
    long temp = 32;
	unsigned char a = ((adfilter >> 5) & 0x3f); // Lower 6 bits
	unsigned char b = ((adfilter >> 11) & 0x1f); // Upper 5 bits

